{"post":{"attributes":{"title":"React as a UI Runtime","date":"2019-02-02","spoiler":"An in-depth description of the React programming model.","link":"/post/react-as-a-ui-runtime","min2read":"🍱🍱🍱 45 min read","wordcount":"7.4k"},"body":"<p>Most tutorials introduce React as a UI library. This makes sense because React <em>is</em> a UI library. That’s literally what the tagline says!</p>\n<p><img src=\"./react.png\" alt=\"React homepage screenshot: &quot;A JavaScript library for building user interfaces&quot;\"></p>\n<p>I’ve written about the challenges of creating <a href=\"/the-elements-of-ui-engineering/\">user interfaces</a> before. But this post talks about React in a different way — more as a <a href=\"https://en.wikipedia.org/wiki/Runtime_system\">programming runtime</a>.</p>\n<p><strong>This post won’t teach you anything about creating user interfaces.</strong> But it might help you understand the React programming model in more depth.</p>\n<hr>\n<p><strong>Note: If you’re <em>learning</em> React, check out <a href=\"https://reactjs.org/docs/getting-started.html#learn-react\">the docs</a> instead.</strong></p>\n<p><font size=\"60\">⚠️</font></p>\n<p><strong>This is a deep dive — THIS IS NOT a beginner-friendly post.</strong> In this post, I’m describing most of the React programming model from first principles. I don’t explain how to use it — just how it works.</p>\n<p>It’s aimed at experienced programmers and folks working on other UI libraries who asked about some tradeoffs chosen in React. I hope you’ll find it useful!</p>\n<p><strong>Many people successfully use React for years without thinking about most of these topics.</strong> This is definitely a programmer-centric view of React rather than, say, a <a href=\"http://mrmrs.cc/writing/2016/04/21/developing-ui/\">designer-centric one</a>. But I don’t think it hurts to have resources for both.</p>\n<p>With that disclaimer out of the way, let’s go!</p>\n<hr>\n<h2>Host Tree</h2>\n<p>Some programs output numbers. Other programs output poems. Different languages and their runtimes are often optimized for a particular set of use cases, and React is no exception to that.</p>\n<p>React programs usually output <strong>a tree that may change over time</strong>. It might be a <a href=\"https://www.npmjs.com/package/react-dom\">DOM tree</a>, an <a href=\"https://developer.apple.com/library/archive/documentation/General/Conceptual/Devpedia-CocoaApp/View%20Hierarchy.html\">iOS hierarchy</a>, a tree of <a href=\"https://react-pdf.org/\">PDF primitives</a>, or even of <a href=\"https://reactjs.org/docs/test-renderer.html\">JSON objects</a>. However, usually, we want to represent some UI with it. We’ll call it a “<em>host</em> tree” because it is a part of the <em>host environment</em> outside of React — like DOM or iOS. The host tree usually has <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Node/appendChild\">its</a> <a href=\"https://developer.apple.com/documentation/uikit/uiview/1622616-addsubview\">own</a> imperative API. React is a layer on top of it.</p>\n<p>So what is React useful for? Very abstractly, it helps you write a program that predictably manipulates a complex host tree in response to external events like interactions, network responses, timers, and so on.</p>\n<p>A specialized tool works better than a generic one when it can impose and benefit from particular constraints. React makes a bet on two principles:</p>\n<ul>\n<li>\n<p><strong>Stability.</strong> The host tree is relatively stable and most updates don’t radically change its overall structure. If an app rearranged all its interactive elements into a completely different combination every second, it would be difficult to use. Where did that button go? Why is my screen dancing?</p>\n</li>\n<li>\n<p><strong>Regularity.</strong> The host tree can be broken down into UI patterns that look and behave consistently (such as buttons, lists, avatars) rather than random shapes.</p>\n</li>\n</ul>\n<p><strong>These principles happen to be true for most UIs.</strong> However, React is ill-suited when there are no stable “patterns” in the output. For example, React may help you write a Twitter client but won’t be very useful for a <a href=\"https://www.youtube.com/watch?v=Uzx9ArZ7MUU\">3D pipes screensaver</a>.</p>\n<h2>Host Instances</h2>\n<p>The host tree consists of nodes. We’ll call them “host instances”.</p>\n<p>In the DOM environment, host instances are regular DOM nodes — like the objects you get when you call <code>document.createElement('div')</code>. On iOS, host instances could be values uniquely identifying a native view from JavaScript.</p>\n<p>Host instances have their own properties (e.g. <code>domNode.className</code> or <code>view.tintColor</code>). They may also contain other host instances as children.</p>\n<p>(This has nothing to do with React — I’m describing the host environments.)</p>\n<p>There is usually an API to manipulate host instances. For example, the DOM provides APIs like <code>appendChild</code>, <code>removeChild</code>, <code>setAttribute</code>, and so on. In React apps, you usually don’t call these APIs. That’s the job of React.</p>\n<h2>Renderers</h2>\n<p>A <em>renderer</em> teaches React to talk to a specific host environment and manage its host instances. React DOM, React Native, and even <a href=\"https://mobile.twitter.com/vadimdemedes/status/1089344289102942211\">Ink</a> are React renderers. You can also <a href=\"https://github.com/facebook/react/tree/master/packages/react-reconciler\">create your own React renderer</a>.</p>\n<p>React renderers can work in one of two modes.</p>\n<p>The vast majority of renderers are written to use the “mutating” mode. This mode is how the DOM works: we can create a node, set its properties, and later add or remove children from it. The host instances are completely mutable.</p>\n<p>React can also work in a <a href=\"https://en.wikipedia.org/wiki/Persistent_data_structure\">“persistent”</a> mode. This mode is for host environments that don’t provide methods like <code>appendChild()</code> but instead clone the parent tree and always replace the top-level child. Immutability on the host tree level makes multi-threading easier. <a href=\"https://facebook.github.io/react-native/blog/2018/06/14/state-of-react-native-2018\">React Fabric</a> takes advantage of that.</p>\n<p>As a React user, you never need to think about these modes. I only want to highlight that React isn’t just an adapter from one mode to another. Its usefulness is orthogonal to the target low-level view API paradigm.</p>\n<h2>React Elements</h2>\n<p>In the host environment, a host instance (like a DOM node) is the smallest building block. In React, the smallest building block is a <em>React element</em>.</p>\n<p>A React element is a plain JavaScript object. It can <em>describe</em> a host instance.</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">// JSX is a syntax sugar for these objects.\n// &lt;button className=&quot;blue&quot; /&gt;\n{\n  type: 'button',\n  props: { className: 'blue' }\n}\n</code></pre><p>A React element is lightweight and has no host instance tied to it. Again, it is merely a <em>description</em> of what you want to see on the screen.</p>\n<p>Like host instances, React elements can form a tree:</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">// JSX is a syntax sugar for these objects.\n// &lt;dialog&gt;\n//   &lt;button className=&quot;blue&quot; /&gt;\n//   &lt;button className=&quot;red&quot; /&gt;\n// &lt;/dialog&gt;\n{\n  type: 'dialog',\n  props: {\n    children: [{\n      type: 'button',\n      props: { className: 'blue' }\n    }, {\n      type: 'button',\n      props: { className: 'red' }\n    }]\n  }\n}\n</code></pre><p><em>(Note: I omitted <a href=\"/why-do-react-elements-have-typeof-property/\">some properties</a> that aren’t important to this explanation.)</em></p>\n<p>However, remember that <strong>React elements don’t have their own persistent identity.</strong> They’re meant to be re-created and thrown away all the time.</p>\n<p>React elements are immutable. For example, you can’t change the children or a property of a React element. If you want to render something different later, you will <em>describe</em> it with a new React element tree created from scratch.</p>\n<p>I like to think of React elements as being like frames in a movie. They capture what the UI should look like at a specific point in time. They don’t change.</p>\n<h2>Entry Point</h2>\n<p>Each React renderer has an “entry point”. It’s the API that lets us tell React to render a particular React element tree inside a container host instance.</p>\n<p>For example, React DOM entry point is <code>ReactDOM.render</code>:</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">ReactDOM.render(\n  // { type: 'button', props: { className: 'blue' } }\n  &lt;button className=&quot;blue&quot; /&gt;,\n  document.getElementById('container')\n);\n</code></pre><p>When we say <code>ReactDOM.render(reactElement, domContainer)</code>, we mean: <strong>“Dear React, make the <code>domContainer</code> host tree match my <code>reactElement</code>.”</strong></p>\n<p>React will look at the <code>reactElement.type</code> (in our example, <code>'button'</code>) and ask the React DOM renderer to create a host instance for it and set the properties:</p>\n<pre data-line=\"3,4,\"  3,4=\"\" class=\"language-jsx\"><code 3,4=\"\" class=\"language-jsx\">// Somewhere in the ReactDOM renderer (simplified)\nfunction createHostInstance(reactElement) {\n  let domNode = document.createElement(reactElement.type);\n  domNode.className = reactElement.props.className;\n  return domNode;\n}\n</code></pre><p>In our example, effectively React will do this:</p>\n<pre data-line=\"1,2,\"  1,2=\"\" class=\"language-jsx\"><code 1,2=\"\" class=\"language-jsx\">let domNode = document.createElement('button');\ndomNode.className = 'blue';\n\ndomContainer.appendChild(domNode);\n</code></pre><p>If the React element has child elements in <code>reactElement.props.children</code>, React will recursively create host instances for them too on the first render.</p>\n<h2>Reconciliation</h2>\n<p>What happens if we call <code>ReactDOM.render()</code> twice with the same container?</p>\n<pre data-line=\"2,11,\"  2,11=\"\" class=\"language-jsx\"><code 2,11=\"\" class=\"language-jsx\">ReactDOM.render(\n  &lt;button className=&quot;blue&quot; /&gt;,\n  document.getElementById('container')\n);\n\n// ... later ...\n\n// Should this *replace* the button host instance\n// or merely update a property on an existing one?\nReactDOM.render(\n  &lt;button className=&quot;red&quot; /&gt;,\n  document.getElementById('container')\n);\n</code></pre><p>Again, React’s job is to <em>make the host tree match the provided React element tree</em>. The process of figuring out <em>what</em> to do to the host instance tree in response to new information is sometimes called <a href=\"https://reactjs.org/docs/reconciliation.html\">reconciliation</a>.</p>\n<p>There are two ways to go about it. A simplified version of React could blow away the existing tree and re-create it from scratch:</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">let domContainer = document.getElementById('container');\n// Clear the tree\ndomContainer.innerHTML = '';\n// Create the new host instance tree\nlet domNode = document.createElement('button');\ndomNode.className = 'red';\ndomContainer.appendChild(domNode);\n</code></pre><p>But in DOM, this is slow and loses important information like focus, selection, scroll state, and so on. Instead, we want React to do something like this:</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">let domNode = domContainer.firstChild;\n// Update existing host instance\ndomNode.className = 'red';\n</code></pre><p>In other words, React needs to decide when to <em>update</em> an existing host instance to match a new React element, and when to create a <em>new</em> one.</p>\n<p>This raises a question of <em>identity</em>. The React element may be different every time, but when does it refer to the same host instance conceptually?</p>\n<p>In our example, it’s simple. We used to render a <code>&lt;button&gt;</code> as a first (and only) child, and we want to render a <code>&lt;button&gt;</code> in the same place again. We already have a <code>&lt;button&gt;</code> host instance there so why re-create it? Let’s just reuse it.</p>\n<p>This is pretty close to how React thinks about it.</p>\n<p><strong>If an element type in the same place in the tree “matches up” between the previous and the next renders, React reuses the existing host instance.</strong></p>\n<p>Here is an example with comments showing roughly what React does:</p>\n<pre data-line=\"9,10,16,26,27,\"  9,10,16,26,27=\"\" class=\"language-jsx\"><code 9,10,16,26,27=\"\" class=\"language-jsx\">// let domNode = document.createElement('button');\n// domNode.className = 'blue';\n// domContainer.appendChild(domNode);\nReactDOM.render(\n  &lt;button className=&quot;blue&quot; /&gt;,\n  document.getElementById('container')\n);\n\n// Can reuse host instance? Yes! (button → button)\n// domNode.className = 'red';\nReactDOM.render(\n  &lt;button className=&quot;red&quot; /&gt;,\n  document.getElementById('container')\n);\n\n// Can reuse host instance? No! (button → p)\n// domContainer.removeChild(domNode);\n// domNode = document.createElement('p');\n// domNode.textContent = 'Hello';\n// domContainer.appendChild(domNode);\nReactDOM.render(\n  &lt;p&gt;Hello&lt;/p&gt;,\n  document.getElementById('container')\n);\n\n// Can reuse host instance? Yes! (p → p)\n// domNode.textContent = 'Goodbye';\nReactDOM.render(\n  &lt;p&gt;Goodbye&lt;/p&gt;,\n  document.getElementById('container')\n);\n</code></pre><p>The same heuristic is used for child trees. For example, when we update a <code>&lt;dialog&gt;</code> with two <code>&lt;button&gt;</code>s inside, React first decides whether to re-use the <code>&lt;dialog&gt;</code>, and then repeats this decision procedure for each child.</p>\n<h2>Conditions</h2>\n<p>If React only reuses host instances when the element types “match up” between updates, how can we render conditional content?</p>\n<p>Say we want to first show only an input, but later render a message before it:</p>\n<pre data-line=\"12,\"  12=\"\" class=\"language-jsx\"><code 12=\"\" class=\"language-jsx\">// First render\nReactDOM.render(\n  &lt;dialog&gt;\n    &lt;input /&gt;\n  &lt;/dialog&gt;,\n  domContainer\n);\n\n// Next render\nReactDOM.render(\n  &lt;dialog&gt;\n    &lt;p&gt;I was just added here!&lt;/p&gt;\n    &lt;input /&gt;\n  &lt;/dialog&gt;,\n  domContainer\n);\n</code></pre><p>In this example, the <code>&lt;input&gt;</code> host instance would get re-created. React would walk the element tree, comparing it with the previous version:</p>\n<ul>\n<li><code>dialog → dialog</code>: Can reuse the host instance? <strong>Yes — the type matches.</strong>\n<ul>\n<li><code>input → p</code>: Can reuse the host instance? <strong>No, the type has changed!</strong> Need to remove the existing <code>input</code> and create a new <code>p</code> host instance.</li>\n<li><code>(nothing) → input</code>: Need to create a new <code>input</code> host instance.</li>\n</ul>\n</li>\n</ul>\n<p>So effectively the update code executed by React would be like:</p>\n<pre data-line=\"1,2,8,9,\"  1,2,8,9=\"\" class=\"language-jsx\"><code 1,2,8,9=\"\" class=\"language-jsx\">let oldInputNode = dialogNode.firstChild;\ndialogNode.removeChild(oldInputNode);\n\nlet pNode = document.createElement('p');\npNode.textContent = 'I was just added here!';\ndialogNode.appendChild(pNode);\n\nlet newInputNode = document.createElement('input');\ndialogNode.appendChild(newInputNode);\n</code></pre><p>This is not great because <em>conceptually</em> the <code>&lt;input&gt;</code> hasn’t been <em>replaced</em> with <code>&lt;p&gt;</code> — it just moved. We don’t want to lose its selection, focus state, and content due to re-creating the DOM.</p>\n<p>While this problem has an easy fix (which we’ll get to in a minute), it doesn’t occur often in React applications. It’s interesting to see why.</p>\n<p>In practice, you would rarely call <code>ReactDOM.render</code> directly. Instead, React apps tend to be broken down into functions like this:</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">function Form({ showMessage }) {\n  let message = null;\n  if (showMessage) {\n    message = &lt;p&gt;I was just added here!&lt;/p&gt;;\n  }\n  return (\n    &lt;dialog&gt;\n      {message}\n      &lt;input /&gt;\n    &lt;/dialog&gt;\n  );\n}\n</code></pre><p>This example doesn’t suffer from the problem we just described. It might be easier to see why if we use object notation instead of JSX. Look at the <code>dialog</code> child element tree:</p>\n<pre data-line=\"12-15,\"  12-15=\"\" class=\"language-jsx\"><code 12-15=\"\" class=\"language-jsx\">function Form({ showMessage }) {\n  let message = null;\n  if (showMessage) {\n    message = {\n      type: 'p',\n      props: { children: 'I was just added here!' }\n    };\n  }\n  return {\n    type: 'dialog',\n    props: {\n      children: [\n        message,\n        { type: 'input', props: {} }\n      ]\n    }\n  };\n}\n</code></pre><p><strong>Regardless of whether <code>showMessage</code> is <code>true</code> or <code>false</code>, the <code>&lt;input&gt;</code> is the second child and doesn’t change its tree position between renders.</strong></p>\n<p>If <code>showMessage</code> changes from <code>false</code> to <code>true</code>, React would walk the element tree, comparing it with the previous version:</p>\n<ul>\n<li><code>dialog → dialog</code>: Can reuse the host instance? <strong>Yes — the type matches.</strong>\n<ul>\n<li><code>(null) → p</code>: Need to insert a new <code>p</code> host instance.</li>\n<li><code>input → input</code>: Can reuse the host instance? <strong>Yes — the type matches.</strong></li>\n</ul>\n</li>\n</ul>\n<p>And the code executed by React would be similar to this:</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">let inputNode = dialogNode.firstChild;\nlet pNode = document.createElement('p');\npNode.textContent = 'I was just added here!';\ndialogNode.insertBefore(pNode, inputNode);\n</code></pre><p>No input state is lost now.</p>\n<h2>Lists</h2>\n<p>Comparing the element type at the same position in the tree is usually enough to decide whether to reuse or re-create the corresponding host instance.</p>\n<p>But this only works well if child positions are static and don’t re-order. In our example above, even though <code>message</code> could be a “hole”, we still knew that the input goes after the message, and there are no other children.</p>\n<p>With dynamic lists, we can’t be sure the order is ever the same:</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">function ShoppingList({ list }) {\n  return (\n    &lt;form&gt;\n      {list.map(item =&gt; (\n        &lt;p&gt;\n          You bought {item.name}\n          &lt;br /&gt;\n          Enter how many do you want: &lt;input /&gt;\n        &lt;/p&gt;\n      ))}\n    &lt;/form&gt;\n  )\n}\n</code></pre><p>If the <code>list</code> of our shopping items is ever re-ordered, React will see that all <code>p</code> and <code>input</code> elements inside have the same type, and won’t know to move them. (From React’s point of view, the <em>items themselves</em> changed, not their order.)</p>\n<p>The code executed by React to re-order 10 items would be something like:</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">for (let i = 0; i &lt; 10; i++) {\n  let pNode = formNode.childNodes[i];\n  let textNode = pNode.firstChild;\n  textNode.textContent = 'You bought ' + items[i].name;\n}\n</code></pre><p>So instead of <em>re-ordering</em> them, React would effectively <em>update</em> each of them. This can create performance issues and possible bugs. For example, the content of the first input would stay reflected in first input <em>after</em> the sort — even though conceptually they might refer to different products in your shopping list!</p>\n<p><strong>This is why React nags you to specify a special property called <code>key</code> every time you include an array of elements in your output:</strong></p>\n<pre data-line=\"5,\"  5=\"\" class=\"language-jsx\"><code 5=\"\" class=\"language-jsx\">function ShoppingList({ list }) {\n  return (\n    &lt;form&gt;\n      {list.map(item =&gt; (\n        &lt;p key={item.productId}&gt;\n          You bought {item.name}\n          &lt;br /&gt;\n          Enter how many do you want: &lt;input /&gt;\n        &lt;/p&gt;\n      ))}\n    &lt;/form&gt;\n  )\n}\n</code></pre><p>A <code>key</code> tells React that it should consider an item to be <em>conceptually</em> the same even if it has different <em>positions</em> inside its parent element between renders.</p>\n<p>When React sees <code>&lt;p key=&quot;42&quot;&gt;</code> inside a <code>&lt;form&gt;</code>, it will check if the previous render also contained <code>&lt;p key=&quot;42&quot;&gt;</code> inside the same <code>&lt;form&gt;</code>. This works even if <code>&lt;form&gt;</code> children changed their order. React will reuse the previous host instance with the same key if it exists, and re-order the siblings accordingly.</p>\n<p>Note that the <code>key</code> is only relevant within a particular parent React element, such as a <code>&lt;form&gt;</code>. React won’t try to “match up” elements with the same keys between different parents. (React doesn’t have idiomatic support for moving a host instance between different parents without re-creating it.)</p>\n<p>What’s a good value for a <code>key</code>? An easy way to answer this is to ask: <strong>when would <em>you</em> say an item is the “same” even if the order changed?</strong> For example, in our shopping list, the product ID uniquely identifies it between siblings.</p>\n<h2>Components</h2>\n<p>We’ve already seen functions that return React elements:</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">function Form({ showMessage }) {\n  let message = null;\n  if (showMessage) {\n    message = &lt;p&gt;I was just added here!&lt;/p&gt;;\n  }\n  return (\n    &lt;dialog&gt;\n      {message}\n      &lt;input /&gt;\n    &lt;/dialog&gt;\n  );\n}\n</code></pre><p>They are called <em>components</em>. They let us create our own “toolbox” of buttons, avatars, comments, and so on. Components are the bread and butter of React.</p>\n<p>Components take one argument — an object hash. It contains “props” (short for “properties”). Here, <code>showMessage</code> is a prop. They’re like named arguments.</p>\n<h2>Purity</h2>\n<p>React components are assumed to be pure with respect to their props.</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">function Button(props) {\n  // 🔴 Doesn't work\n  props.isActive = true;\n}\n</code></pre><p>In general, mutation is not idiomatic in React. (We’ll talk more about the idiomatic way to update the UI in response to events later.)</p>\n<p>However, <em>local mutation</em> is absolutely fine:</p>\n<pre data-line=\"2,5,\"  2,5=\"\" class=\"language-jsx\"><code 2,5=\"\" class=\"language-jsx\">function FriendList({ friends }) {\n  let items = [];\n  for (let i = 0; i &lt; friends.length; i++) {\n    let friend = friends[i];\n    items.push(\n      &lt;Friend key={friend.id} friend={friend} /&gt;\n    );\n  }\n  return &lt;section&gt;{items}&lt;/section&gt;;\n}\n</code></pre><p>We created <code>items</code> <em>while rendering</em> and no other component “saw” it so we can mutate it as much as we like before handing it off as part of the render result. There is no need to contort your code to avoid local mutation.</p>\n<p>Similarly, lazy initialization is fine despite not being fully “pure”:</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">function ExpenseForm() {\n  // Fine if it doesn't affect other components:\n  SuperCalculator.initializeIfNotReady();\n\n  // Continue rendering...\n}\n</code></pre><p>As long as calling a component multiple times is safe and doesn’t affect the rendering of other components, React doesn’t care if it’s 100% pure in the strict FP sense of the word. <a href=\"https://stackoverflow.com/questions/1077412/what-is-an-idempotent-operation\">Idempotence</a> is more important to React than purity.</p>\n<p>That said, side effects that are directly visible to the user are not allowed in React components. In other words, merely <em>calling</em> a component function shouldn’t by itself produce a change on the screen.</p>\n<h2>Recursion</h2>\n<p>How do we <em>use</em> components from other components? Components are functions so we <em>could</em> call them:</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">let reactElement = Form({ showMessage: true });\nReactDOM.render(reactElement, domContainer);\n</code></pre><p>However, this is <em>not</em> the idiomatic way to use components in the React runtime.</p>\n<p>Instead, the idiomatic way to use a component is with the same mechanism we’ve already seen before — React elements. <strong>This means that you don’t directly call the component function, but instead let React later do it for you</strong>:</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">// { type: Form, props: { showMessage: true } }\nlet reactElement = &lt;Form showMessage={true} /&gt;;\nReactDOM.render(reactElement, domContainer);\n</code></pre><p>And somewhere inside React, your component will be called:</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">// Somewhere inside React\nlet type = reactElement.type; // Form\nlet props = reactElement.props; // { showMessage: true }\nlet result = type(props); // Whatever Form returns\n</code></pre><p>Component function names are by convention capitalized. When the JSX transform sees <code>&lt;Form&gt;</code> rather than <code>&lt;form&gt;</code>, it makes the object <code>type</code> itself an identifier rather than a string:</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">console.log(&lt;form /&gt;.type); // 'form' string\nconsole.log(&lt;Form /&gt;.type); // Form function\n</code></pre><p>There is no global registration mechanism — we literally refer to <code>Form</code> by name when typing <code>&lt;Form /&gt;</code>. If <code>Form</code> doesn’t exist in local scope, you’ll see a JavaScript error just like you normally would with a bad variable name.</p>\n<p><strong>Okay, so what does React do when an element type is a function? It calls your component, and asks what element <em>that</em> component wants to render.</strong></p>\n<p>This process continues recursively and is described in more detail <a href=\"https://reactjs.org/blog/2015/12/18/react-components-elements-and-instances.html\">here</a>. In short, it looks like this:</p>\n<ul>\n<li><strong>You:</strong> <code>ReactDOM.render(&lt;App /&gt;, domContainer)</code></li>\n<li><strong>React:</strong> Hey <code>App</code>, what do you render to?\n<ul>\n<li><code>App</code>: I render <code>&lt;Layout&gt;</code> with <code>&lt;Content&gt;</code> inside.</li>\n</ul>\n</li>\n<li><strong>React:</strong> Hey <code>Layout</code>, what do you render to?\n<ul>\n<li><code>Layout</code>: I render my children in a <code>&lt;div&gt;</code>. My child was <code>&lt;Content&gt;</code> so I guess that goes into the <code>&lt;div&gt;</code>.</li>\n</ul>\n</li>\n<li><strong>React:</strong> Hey <code>&lt;Content&gt;</code>, what do you render to?\n<ul>\n<li><code>Content</code>: I render an <code>&lt;article&gt;</code> with some text and a <code>&lt;Footer&gt;</code> inside.</li>\n</ul>\n</li>\n<li><strong>React:</strong> Hey <code>&lt;Footer&gt;</code>, what do you render to?\n<ul>\n<li><code>Footer</code>: I render a <code>&lt;footer&gt;</code> with some more text.</li>\n</ul>\n</li>\n<li><strong>React:</strong> Okay, here you go:</li>\n</ul>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">// Resulting DOM structure\n&lt;div&gt;\n  &lt;article&gt;\n    Some text\n    &lt;footer&gt;some more text&lt;/footer&gt;\n  &lt;/article&gt;\n&lt;/div&gt;\n</code></pre><p>This is why we say reconciliation is recursive. When React walks the element tree, it might meet an element whose <code>type</code> is a component. It will call it and keep descending down the tree of returned React elements. Eventually, we’ll run out of components, and React will know what to change in the host tree.</p>\n<p>The same reconciliation rules we already discussed apply here too. If the <code>type</code> at the same position (as determined by index and optional <code>key</code>) changes, React will throw away the host instances inside, and re-create them.</p>\n<h2>Inversion of Control</h2>\n<p>You might be wondering: why don’t we just call components directly? Why write <code>&lt;Form /&gt;</code> rather than <code>Form()</code>?</p>\n<p><strong>React can do its job better if it “knows” about your components rather than if it only sees the React element tree after recursively calling them.</strong></p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">// 🔴 React has no idea Layout and Article exist.\n// You're calling them.\nReactDOM.render(\n  Layout({ children: Article() }),\n  domContainer\n)\n\n// ✅ React knows Layout and Article exist.\n// React calls them.\nReactDOM.render(\n  &lt;Layout&gt;&lt;Article /&gt;&lt;/Layout&gt;,\n  domContainer\n)\n</code></pre><p>This is a classic example of <a href=\"https://en.wikipedia.org/wiki/Inversion_of_control\">inversion of control</a>. There’s a few interesting properties we get by letting React take control of calling our components:</p>\n<ul>\n<li>\n<p><strong>Components become more than functions.</strong> React can augment component functions with features like <em>local state</em> that are tied to the component identity in the tree. A good runtime provides fundamental abstractions that match the problem at hand. As we already mentioned, React is oriented specifically at programs that render UI trees and respond to interactions. If you called components directly, you’d have to build these features yourself.</p>\n</li>\n<li>\n<p><strong>Component types participate in the reconciliation.</strong> By letting React call your components, you also tell it more about the conceptual structure of your tree. For example, when you move from rendering <code>&lt;Feed&gt;</code> to the <code>&lt;Profile&gt;</code> page, React won’t attempt to re-use host instances inside them — just like when you replace <code>&lt;button&gt;</code> with a <code>&lt;p&gt;</code>. All state will be gone — which is usually good when you render a conceptually different view. You wouldn't want to preserve input state between <code>&lt;PasswordForm&gt;</code> and <code>&lt;MessengerChat&gt;</code> even if the <code>&lt;input&gt;</code> position in the tree accidentally “lines up” between them.</p>\n</li>\n<li>\n<p><strong>React can delay the reconciliation.</strong> If React takes control over calling our components, it can do many interesting things. For example, it can let the browser do some work between the component calls so that re-rendering a large component tree <a href=\"https://reactjs.org/blog/2018/03/01/sneak-peek-beyond-react-16.html\">doesn’t block the main thread</a>. Orchestrating this manually without reimplementing a large part of React is difficult.</p>\n</li>\n<li>\n<p><strong>A better debugging story.</strong> If components are first-class citizens that the library is aware of, we can build <a href=\"https://github.com/facebook/react-devtools\">rich developer tools</a> for introspection in development.</p>\n</li>\n</ul>\n<p>The last benefit to React calling your component functions is <em>lazy evaluation</em>. Let’s see what this means.</p>\n<h2>Lazy Evaluation</h2>\n<p>When we call functions in JavaScript, arguments are evaluated before the call:</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">// (2) This gets computed second\neat(\n  // (1) This gets computed first\n  prepareMeal()\n);\n</code></pre><p>This is usually what JavaScript developers expect because JavaScript functions can have implicit side effects. It would be surprising if we called a function, but it wouldn’t execute until its result gets somehow “used” in JavaScript.</p>\n<p>However, React components are <a href=\"#purity\">relatively</a> pure. There is absolutely no need to execute it if we know its result won’t get rendered on the screen.</p>\n<p>Consider this component putting <code>&lt;Comments&gt;</code> inside a <code>&lt;Page&gt;</code>:</p>\n<pre data-line=\"11,\"  11=\"\" class=\"language-jsx\"><code 11=\"\" class=\"language-jsx\">function Story({ currentUser }) {\n  // return {\n  //   type: Page,\n  //   props: {\n  //     user: currentUser,\n  //     children: { type: Comments, props: {} }\n  //   }\n  // }\n  return (\n    &lt;Page user={currentUser}&gt;\n      &lt;Comments /&gt;\n    &lt;/Page&gt;\n  );\n}\n</code></pre><p>The <code>Page</code> component can render the children given to it inside some <code>Layout</code>:</p>\n<pre data-line=\"4,\"  4=\"\" class=\"language-jsx\"><code 4=\"\" class=\"language-jsx\">function Page({ user, children }) {\n  return (\n    &lt;Layout&gt;\n      {children}\n    &lt;/Layout&gt;\n  );\n}\n</code></pre><p><em>(<code>&lt;A&gt;&lt;B /&gt;&lt;/A&gt;</code> in JSX is the same as <code>&lt;A children={&lt;B /&gt;} /&gt;</code>.)</em></p>\n<p>But what if it has an early exit condition?</p>\n<pre data-line=\"2-4,\"  2-4=\"\" class=\"language-jsx\"><code 2-4=\"\" class=\"language-jsx\">function Page({ user, children }) {\n  if (!user.isLoggedIn) {\n    return &lt;h1&gt;Please log in&lt;/h1&gt;;\n  }\n  return (\n    &lt;Layout&gt;\n      {children}\n    &lt;/Layout&gt;\n  );\n}\n</code></pre><p>If we called <code>Comments()</code> as a function, it would execute immediately regardless of whether <code>Page</code> wants to render them or not:</p>\n<pre data-line=\"4,8,\"  4,8=\"\" class=\"language-jsx\"><code 4,8=\"\" class=\"language-jsx\">// {\n//   type: Page,\n//   props: {\n//     children: Comments() // Always runs!\n//   }\n// }\n&lt;Page&gt;\n  {Comments()}\n&lt;/Page&gt;\n</code></pre><p>But if we pass a React element, we don’t execute <code>Comments</code> ourselves at all:</p>\n<pre data-line=\"4,8,\"  4,8=\"\" class=\"language-jsx\"><code 4,8=\"\" class=\"language-jsx\">// {\n//   type: Page,\n//   props: {\n//     children: { type: Comments }\n//   }\n// }\n&lt;Page&gt;\n  &lt;Comments /&gt;\n&lt;/Page&gt;\n</code></pre><p>This lets React decide when and <em>whether</em> to call it. If our <code>Page</code> component ignores its <code>children</code> prop and renders<br>\n<code>&lt;h1&gt;Please log in&lt;/h1&gt;</code> instead, React won’t even attempt to call the <code>Comments</code> function. What’s the point?</p>\n<p>This is good because it both lets us avoid unnecessary rendering work that would be thrown away, and makes the code less fragile. (We don’t care if <code>Comments</code> throws or not when the user is logged out — it won’t be called.)</p>\n<h2>State</h2>\n<p>We talked <a href=\"#reconciliation\">earlier</a> about identity and how an element’s conceptual “position” in the tree tells React whether to re-use a host instance or create a new one. Host instances can have all kinds of local state: focus, selection, input, etc. We want to preserve this state between updates that conceptually render the same UI. We also want to predictably destroy it when we render something conceptually different (such as moving from <code>&lt;SignupForm&gt;</code> to <code>&lt;MessengerChat&gt;</code>).</p>\n<p><strong>Local state is so useful that React lets <em>your own</em> components have it too.</strong> Components are still functions but React augments them with features that are useful for UIs. Local state tied to the position in the tree is one of these features.</p>\n<p>We call these features <em>Hooks</em>. For example, <code>useState</code> is a Hook.</p>\n<pre data-line=\"2,6,7,\"  2,6,7=\"\" class=\"language-jsx\"><code 2,6,7=\"\" class=\"language-jsx\">function Example() {\n  const [count, setCount] = useState(0);\n\n  return (\n    &lt;div&gt;\n      &lt;p&gt;You clicked {count} times&lt;/p&gt;\n      &lt;button onClick={() =&gt; setCount(count + 1)}&gt;\n        Click me\n      &lt;/button&gt;\n    &lt;/div&gt;\n  );\n}\n</code></pre><p>It returns a pair of values: the current state and a function that updates it.</p>\n<p>The <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Destructuring_assignment#Array_destructuring\">array destructuring</a> syntax lets us give arbitrary names to our state variables. For example, I called this pair <code>count</code> and <code>setCount</code>, but it could’ve been <code>banana</code> and <code>setBanana</code>. In the text below, I will use <code>setState</code> to refer to the second value regardless of its actual name in the specific examples.</p>\n<p><em>(You can learn more about <code>useState</code> and other Hooks provided by React <a href=\"https://reactjs.org/docs/hooks-intro.html\">here</a>.)</em></p>\n<h2>Consistency</h2>\n<p>Even if we want to split the reconciliation process itself into <a href=\"https://www.youtube.com/watch?v=mDdgfyRB5kg\">non-blocking</a> chunks of work, we should still perform the actual host tree operations in a single synchronous swoop. This way we can ensure that the user doesn’t see a half-updated UI, and that the browser doesn’t perform unnecessary layout and style recalculation for intermediate states that the user shouldn’t see.</p>\n<p>This is why React splits all work into the “render phase” and the “commit phase”. <em>Render phase</em> is when React calls your components and performs reconciliation. It is safe to interrupt and <a href=\"https://reactjs.org/blog/2018/03/01/sneak-peek-beyond-react-16.html\">in the future</a> will be asynchronous. <em>Commit phase</em> is when React touches the host tree. It is always synchronous.</p>\n<h2>Memoization</h2>\n<p>When a parent schedules an update by calling <code>setState</code>, by default React reconciles its whole child subtree. This is because React can’t know whether an update in the parent would affect the child or not, and by default, React opts to be consistent. This may sound very expensive but in practice, it’s not a problem for small and medium-sized subtrees.</p>\n<p>When trees get too deep or wide, you can tell React to <a href=\"https://en.wikipedia.org/wiki/Memoization\">memoize</a> a subtree and reuse previous render results during shallow equal prop changes:</p>\n<pre data-line=\"5,\"  5=\"\" class=\"language-jsx\"><code 5=\"\" class=\"language-jsx\">function Row({ item }) {\n  // ...\n}\n\nexport default React.memo(Row);\n</code></pre><p>Now <code>setState</code> in a parent <code>&lt;Table&gt;</code> component would skip over reconciling <code>Row</code>s whose <code>item</code> is referentially equal to the <code>item</code> rendered last time.</p>\n<p>You can get fine-grained memoization at the level of individual expressions with the <a href=\"https://reactjs.org/docs/hooks-reference.html#usememo\"><code>useMemo()</code> Hook</a>. The cache is local to component tree position and will be destroyed together with its local state. It only holds one last item.</p>\n<p>React intentionally doesn’t memoize components by default. Many components always receive different props so memoizing them would be a net loss.</p>\n<h2>Raw Models</h2>\n<p>Ironically, React doesn’t use a “reactivity” system for fine-grained updates. In other words, any update at the top triggers reconciliation instead of updating just the components affected by changes.</p>\n<p>This is an intentional design decision. <a href=\"https://calibreapp.com/blog/time-to-interactive/\">Time to interactive</a> is a crucial metric in consumer web applications, and traversing models to set up fine-grained listeners spends that precious time. Additionally, in many apps, interactions tend to result either in small (button hover) or large (page transition) updates, in which case fine-grained subscriptions are a waste of memory resources.</p>\n<p>One of the core design principles of React is that it works with raw data. If you have a bunch of JavaScript objects received from the network, you can pump them directly into your components with no preprocessing. There are no gotchas about which properties you can access, or unexpected performance cliffs when a structure slightly changes. React rendering is O(<em>view size</em>) rather than O(<em>model size</em>), and you can significantly cut the <em>view size</em> with <a href=\"https://react-window.now.sh/#/examples/list/fixed-size\">windowing</a>.</p>\n<p>There are some kinds of applications where fine-grained subscriptions are beneficial — such as stock tickers. This is a rare example of “everything constantly updating at the same time”. While imperative escape hatches can help optimize such code, React might not be the best fit for this use case. Still, you can implement your own fine-grained subscription system on top of React.</p>\n<p><strong>Note that there are common performance issues that even fine-grained subscriptions and “reactivity” systems can’t solve.</strong> For example, rendering a <em>new</em> deep tree (which happens on every page transition) without blocking the browser. Change tracking doesn’t make it faster — it makes it slower because we have to do more work to set up subscriptions. Another problem is that we have to wait for data before we can start rendering the view. In React, we aim to solve both of these problems with <a href=\"https://reactjs.org/blog/2018/03/01/sneak-peek-beyond-react-16.html\">Concurrent Rendering</a>.</p>\n<h2>Batching</h2>\n<p>Several components may want to update state in response to the same event. This example is contrived but it illustrates a common pattern:</p>\n<pre data-line=\"4,14,\"  4,14=\"\" class=\"language-jsx\"><code 4,14=\"\" class=\"language-jsx\">function Parent() {\n  let [count, setCount] = useState(0);\n  return (\n    &lt;div onClick={() =&gt; setCount(count + 1)}&gt;\n      Parent clicked {count} times\n      &lt;Child /&gt;\n    &lt;/div&gt;\n  );\n}\n\nfunction Child() {\n  let [count, setCount] = useState(0);\n  return (\n    &lt;button onClick={() =&gt; setCount(count + 1)}&gt;\n      Child clicked {count} times\n    &lt;/button&gt;\n  );\n}\n</code></pre><p>When an event is dispatched, the child’s <code>onClick</code> fires first (triggering its <code>setState</code>). Then the parent calls <code>setState</code> in its own <code>onClick</code> handler.</p>\n<p>If React immediately re-rendered components in response to <code>setState</code> calls, we’d end up rendering the child twice:</p>\n<pre data-line=\"4,8,\"  4,8=\"\" class=\"language-jsx\"><code 4,8=\"\" class=\"language-jsx\">*** Entering React's browser click event handler ***\nChild (onClick)\n  - setState\n  - re-render Child // 😞 unnecessary\nParent (onClick)\n  - setState\n  - re-render Parent\n  - re-render Child\n*** Exiting React's browser click event handler ***\n</code></pre><p>The first <code>Child</code> render would be wasted. And we couldn’t make React skip rendering <code>Child</code> for the second time because the <code>Parent</code> might pass some different data to it based on its updated state.</p>\n<p><strong>This is why React batches updates inside event handlers:</strong></p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">*** Entering React's browser click event handler ***\nChild (onClick)\n  - setState\nParent (onClick)\n  - setState\n*** Processing state updates                     ***\n  - re-render Parent\n  - re-render Child\n*** Exiting React's browser click event handler  ***\n</code></pre><p>The <code>setState</code> calls in components wouldn’t immediately cause a re-render. Instead, React would execute all event handlers first, and then trigger a single re-render batching all of those updates together.</p>\n<p>Batching is good for performance but can be surprising if you write code like:</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">  const [count, setCount] = useState(0);\n\n  function increment() {\n    setCount(count + 1);\n  }\n\n  function handleClick() {\n    increment();\n    increment();\n    increment();\n  }\n</code></pre><p>If we start with <code>count</code> set to <code>0</code>, these would just be three <code>setCount(1)</code> calls. To fix this, <code>setState</code> provides an overload that accepts an “updater” function:</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">  const [count, setCount] = useState(0);\n\n  function increment() {\n    setCount(c =&gt; c + 1);\n  }\n\n  function handleClick() {\n    increment();\n    increment();\n    increment();\n  }\n</code></pre><p>React would put the updater functions in a queue, and later run them in sequence, resulting in a re-render with <code>count</code> set to <code>3</code>.</p>\n<p>When state logic gets more complex than a few <code>setState</code> calls, I recommend expressing it as a local state reducer with the <a href=\"https://reactjs.org/docs/hooks-reference.html#usereducer\"><code>useReducer</code> Hook</a>. It’s like an evolution of this “updater” pattern where each update is given a name:</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">  const [counter, dispatch] = useReducer((state, action) =&gt; {\n    if (action === 'increment') {\n      return state + 1;\n    } else {\n      return state;\n    }\n  }, 0);\n\n  function handleClick() {\n    dispatch('increment');\n    dispatch('increment');\n    dispatch('increment');\n  }\n</code></pre><p>The <code>action</code> argument can be anything, although an object is a common choice.</p>\n<h2>Call Tree</h2>\n<p>A programming language runtime usually has a <a href=\"https://medium.freecodecamp.org/understanding-the-javascript-call-stack-861e41ae61d4\">call stack</a>. When a function <code>a()</code> calls <code>b()</code> which itself calls <code>c()</code>, somewhere in the JavaScript engine there’s a data structure like <code>[a, b, c]</code> that “keeps track” of where you are and what code to execute next. Once you exit out of <code>c</code>, its call stack frame is gone — poof! It’s not needed anymore. We jump back into <code>b</code>. By the time we exit <code>a</code>, the call stack is empty.</p>\n<p>Of course, React itself runs in JavaScript and obeys JavaScript rules. But we can imagine that internally React has some kind of its own call stack to remember which component we are currently rendering, e.g. <code>[App, Page, Layout, Article /* we're here */]</code>.</p>\n<p>React is different from a general purpose language runtime because it’s aimed at rendering UI trees. These trees need to “stay alive” for us to interact with them. The DOM doesn’t disappear after our first <code>ReactDOM.render()</code> call.</p>\n<p>This may be stretching the metaphor but I like to think of React components as being in a “call tree” rather than just a “call stack”. When we go “out” of the <code>Article</code> component, its React “call tree” frame doesn’t get destroyed. We need to keep the local state and references to the host instances <a href=\"https://medium.com/react-in-depth/the-how-and-why-on-reacts-usage-of-linked-list-in-fiber-67f1014d0eb7\">somewhere</a>.</p>\n<p>These “call tree” frames <em>are</em> destroyed along with their local state and host instances, but only when the <a href=\"#reconciliation\">reconciliation</a> rules say it’s necessary. If you ever read React source, you might have seen these frames being referred to as <a href=\"https://en.wikipedia.org/wiki/Fiber_(computer_science)\">Fibers</a>.</p>\n<p>Fibers are where the local state actually lives. When the state is updated, React marks the Fibers below as needing reconciliation, and calls those components.</p>\n<h2>Context</h2>\n<p>In React, we pass things down to other components as props. Sometimes, the majority of components need the same thing — for example, the currently chosen visual theme. It gets cumbersome to pass it down through every level.</p>\n<p>In React, this is solved by <a href=\"https://reactjs.org/docs/context.html\">Context</a>. It is essentially like <a href=\"http://wiki.c2.com/?DynamicScoping\">dynamic scoping</a> for components. It’s like a wormhole that lets you put something on the top, and have every child at the bottom be able to read it and re-render when it changes.</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">const ThemeContext = React.createContext(\n  'light' // Default value as a fallback\n);\n\nfunction DarkApp() {\n  return (\n    &lt;ThemeContext.Provider value=&quot;dark&quot;&gt;\n      &lt;MyComponents /&gt;\n    &lt;/ThemeContext.Provider&gt;\n  );\n}\n\nfunction SomeDeeplyNestedChild() {\n  // Depends on where the child is rendered\n  const theme = useContext(ThemeContext);\n  // ...\n}\n</code></pre><p>When <code>SomeDeeplyNestedChild</code> renders, <code>useContext(ThemeContext)</code> will look for the closest <code>&lt;ThemeContext.Provider&gt;</code> above it in the tree, and use its <code>value</code>.</p>\n<p>(In practice, React maintains a context stack while it renders.)</p>\n<p>If there’s no <code>ThemeContext.Provider</code> above, the result of <code>useContext(ThemeContext)</code> call will be the default value specified in the <code>createContext()</code> call. In our example, it is <code>'light'</code>.</p>\n<h2>Effects</h2>\n<p>We mentioned earlier that React components shouldn’t have observable side effects during rendering. But side effects are sometimes necessary. We may want to manage focus, draw on a canvas, subscribe to a data source, and so on.</p>\n<p>In React, this is done by declaring an effect:</p>\n<pre data-line=\"4-6,\"  4-6=\"\" class=\"language-jsx\"><code 4-6=\"\" class=\"language-jsx\">function Example() {\n  const [count, setCount] = useState(0);\n\n  useEffect(() =&gt; {\n    document.title = `You clicked ${count} times`;\n  });\n\n  return (\n    &lt;div&gt;\n      &lt;p&gt;You clicked {count} times&lt;/p&gt;\n      &lt;button onClick={() =&gt; setCount(count + 1)}&gt;\n        Click me\n      &lt;/button&gt;\n    &lt;/div&gt;\n  );\n}\n</code></pre><p>When possible, React defers executing effects until after the browser re-paints the screen. This is good because code like data source subscriptions shouldn’t hurt <a href=\"https://calibreapp.com/blog/time-to-interactive/\">time to interactive</a> and <a href=\"https://developers.google.com/web/tools/lighthouse/audits/first-meaningful-paint\">time to first paint</a>. (There's a <a href=\"https://reactjs.org/docs/hooks-reference.html#uselayouteffect\">rarely used</a> Hook that lets you opt out of that behavior and do things synchronously. Avoid it.)</p>\n<p>Effects don’t just run once. They run both after a component is shown to the user for the first time, and after it updates. Effects can close over current props and state, such as with <code>count</code> in the above example.</p>\n<p>Effects may require cleanup, such as in case of subscriptions. To clean up after itself, an effect can return a function:</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">  useEffect(() =&gt; {\n    DataSource.addSubscription(handleChange);\n    return () =&gt; DataSource.removeSubscription(handleChange);\n  });\n</code></pre><p>React will execute the returned function before applying this effect the next time, and also before the component is destroyed.</p>\n<p>Sometimes, re-running the effect on every render can be undesirable. You can tell React to <a href=\"https://reactjs.org/docs/hooks-effect.html#tip-optimizing-performance-by-skipping-effects\">skip</a> applying an effect if certain variables didn’t change:</p>\n<pre data-line=\"3,\"  3=\"\" class=\"language-jsx\"><code 3=\"\" class=\"language-jsx\">  useEffect(() =&gt; {\n    document.title = `You clicked ${count} times`;\n  }, [count]);\n</code></pre><p>However, it is often a premature optimization and can lead to problems if you’re not familiar with how JavaScript closures work.</p>\n<p>For example, this code is buggy:</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">  useEffect(() =&gt; {\n    DataSource.addSubscription(handleChange);\n    return () =&gt; DataSource.removeSubscription(handleChange);\n  }, []);\n</code></pre><p>It is buggy because <code>[]</code> says “don’t ever re-execute this effect”. But the effect closes over <code>handleChange</code> which is defined outside of it. And <code>handleChange</code> might reference any props or state:</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">  function handleChange() {\n    console.log(count);\n  }\n</code></pre><p>If we never let the effect re-run, <code>handleChange</code> will keep pointing at the version from the first render, and <code>count</code> will always be <code>0</code> inside of it.</p>\n<p>To solve this, make sure that if you specify the dependency array, it includes <strong>all</strong> things that can change, including the functions:</p>\n<pre data-line=\"4,\"  4=\"\" class=\"language-jsx\"><code 4=\"\" class=\"language-jsx\">  useEffect(() =&gt; {\n    DataSource.addSubscription(handleChange);\n    return () =&gt; DataSource.removeSubscription(handleChange);\n  }, [handleChange]);\n</code></pre><p>Depending on your code, you might still see unnecessary resubscriptions because <code>handleChange</code> itself is different on every render. The <a href=\"https://reactjs.org/docs/hooks-reference.html#usecallback\"><code>useCallback</code></a> Hook can help you with that. Alternatively, you can just let it re-subscribe. For example, browser’s <code>addEventListener</code> API is extremely fast, and jumping through hoops to avoid calling it might cause more problems than it’s worth.</p>\n<p><em>(You can learn more about <code>useEffect</code> and other Hooks provided by React <a href=\"https://reactjs.org/docs/hooks-effect.html\">here</a>.)</em></p>\n<h2>Custom Hooks</h2>\n<p>Since Hooks like <code>useState</code> and <code>useEffect</code> are function calls, we can compose them into our own Hooks:</p>\n<pre data-line=\"2,8,\"  2,8=\"\" class=\"language-jsx\"><code 2,8=\"\" class=\"language-jsx\">function MyResponsiveComponent() {\n  const width = useWindowWidth(); // Our custom Hook\n  return (\n    &lt;p&gt;Window width is {width}&lt;/p&gt;\n  );\n}\n\nfunction useWindowWidth() {\n  const [width, setWidth] = useState(window.innerWidth);\n  useEffect(() =&gt; {\n    const handleResize = () =&gt; setWidth(window.innerWidth);\n    window.addEventListener('resize', handleResize);\n    return () =&gt; {\n      window.removeEventListener('resize', handleResize);\n    };\n  });\n  return width;\n}\n</code></pre><p>Custom Hooks let different components share reusable stateful logic. Note that the <em>state itself</em> is not shared. Each call to a Hook declares its own isolated state.</p>\n<p><em>(You can learn more about writing your own Hooks <a href=\"https://reactjs.org/docs/hooks-custom.html\">here</a>.)</em></p>\n<h2>Static Use Order</h2>\n<p>You can think of <code>useState</code> as a syntax for defining a “React state variable”. It’s not <em>really</em> a syntax, of course. We’re still writing JavaScript. But we are looking at React as a runtime environment, and because React tailors JavaScript to describing UI trees, its features sometimes live closer to the language space.</p>\n<p>If <code>use</code> <em>were</em> a syntax, it would make sense for it to be at the top level:</p>\n<pre data-line=\"3,\"  3=\"\" class=\"language-jsx\"><code 3=\"\" class=\"language-jsx\">// 😉 Note: not a real syntax\ncomponent Example(props) {\n  const [count, setCount] = use State(0);\n\n  return (\n    &lt;div&gt;\n      &lt;p&gt;You clicked {count} times&lt;/p&gt;\n      &lt;button onClick={() =&gt; setCount(count + 1)}&gt;\n        Click me\n      &lt;/button&gt;\n    &lt;/div&gt;\n  );\n}\n</code></pre><p>What would putting it into a condition or a callback or outside a component even mean?</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">// 😉 Note: not a real syntax\n\n// This is local state... of what?\nconst [count, setCount] = use State(0);\n\ncomponent Example() {\n  if (condition) {\n    // What happens to it when condition is false?\n    const [count, setCount] = use State(0);\n  }\n\n  function handleClick() {\n    // What happens to it when we leave a function?\n    // How is this different from a variable?\n    const [count, setCount] = use State(0);\n  }\n</code></pre><p>React state is local to the <em>component</em> and its identity in the tree. If <code>use</code> were a real syntax it would make sense to scope it to the top-level of a component too:</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">// 😉 Note: not a real syntax\ncomponent Example(props) {\n  // Only valid here\n  const [count, setCount] = use State(0);\n\n  if (condition) {\n    // This would be a syntax error\n    const [count, setCount] = use State(0);\n  }\n</code></pre><p>This is similar to how <code>import</code> only works at the top level of a module.</p>\n<p><strong>Of course, <code>use</code> is not actually a syntax.</strong> (It wouldn’t bring much benefit and would create a lot of friction.)</p>\n<p>However, React <em>does</em> expect that all calls to Hooks happen only at the top level of a component and unconditionally. These <a href=\"https://reactjs.org/docs/hooks-rules.html\">Rules of Hooks</a> can be enforced with <a href=\"https://www.npmjs.com/package/eslint-plugin-react-hooks\">a linter plugin</a>. There have been heated arguments about this design choice but in practice, I haven’t seen it confusing people. I also wrote about why commonly proposed alternatives <a href=\"https://overreacted.io/why-do-hooks-rely-on-call-order/\">don’t work</a>.</p>\n<p>Internally, Hooks are implemented as <a href=\"https://dev.to/aspittel/thank-u-next-an-introduction-to-linked-lists-4pph\">linked lists</a>. When you call <code>useState</code>, we move the pointer to the next item. When we exit the component’s <a href=\"#call-tree\">“call tree” frame</a>, we save the resulting list there until the next render.</p>\n<p><a href=\"https://medium.com/@ryardley/react-hooks-not-magic-just-arrays-cd4f1857236e\">This article</a> provides a simplified explanation for how Hooks work internally. Arrays might be an easier mental model than linked lists:</p>\n<pre   class=\"language-jsx\"><code class=\"language-jsx\">// Pseudocode\nlet hooks, i;\nfunction useState() {\n  i++;\n  if (hooks[i]) {\n    // Next renders\n    return hooks[i];\n  }\n  // First render\n  hooks.push(...);\n}\n\n// Prepare to render\ni = -1;\nhooks = fiber.hooks || [];\n// Call the component\nYourComponent();\n// Remember the state of Hooks\nfiber.hooks = hooks;\n</code></pre><p><em>(If you’re curious, the real code is <a href=\"https://github.com/facebook/react/blob/master/packages/react-reconciler/src/ReactFiberHooks.js\">here</a>.)</em></p>\n<p>This is roughly how each <code>useState()</code> call gets the right state. As we’ve learned <a href=\"#reconciliation\">earlier</a>, “matching things up” isn’t new to React — reconciliation relies on the elements matching up between renders in a similar way.</p>\n<h2>What’s Left Out</h2>\n<p>We’ve touched on pretty much all important aspects of the React runtime environment. If you finished this page, you probably know React in more detail than 90% of its users. And there’s nothing wrong with that!</p>\n<p>There are some parts I left out — mostly because they’re unclear even to us. React doesn’t currently have a good story for multipass rendering, i.e. when the parent render needs information about the children. Also, the <a href=\"https://reactjs.org/docs/error-boundaries.html\">error handling API</a> doesn’t yet have a Hooks version. It’s possible that these two problems can be solved together. Concurrent Mode is not stable yet, and there are interesting questions about how Suspense fits into this picture. Maybe I’ll do a follow-up when they’re fleshed out and Suspense is ready for more than <a href=\"https://reactjs.org/blog/2018/10/23/react-v-16-6.html#reactlazy-code-splitting-with-suspense\">lazy loading</a>.</p>\n<p><strong>I think it speaks to the success of React’s API that you can get very far without ever thinking about most of these topics.</strong> Good defaults like the reconciliation heuristics do the right thing in most cases. Warnings, like the <code>key</code> warning, nudge you when you risk shooting yourself in the foot.</p>\n<p>If you’re a UI library nerd, I hope this post was somewhat entertaining and clarified how React works in more depth. Or maybe you decided React is too complicated and you’ll never look at it again. In either case, I’d love to hear from you on Twitter! Thank you for reading.</p>\n","frontmatter":"title: React as a UI Runtime\ndate: '2019-02-02'\nspoiler: An in-depth description of the React programming model.","link":"/post/react-as-a-ui-runtime","prev":{"title":"将 React 作为 UI 运行时","date":"2019-02-02","spoiler":"深入理解 React 编程模型","link":"/post/react-as-a-ui-runtime-zh","min2read":"🍱🍱🍱 42 min read","wordcount":"11.2k"}}}