{"post":{"attributes":{"title":"Optimized for Change","date":"2018-12-12","spoiler":"What makes a great API?","link":"/post/optimized-for-change","min2read":"☕️ 1 min read","wordcount":238},"body":"<p>What makes a great API?</p>\n<p><em>Good</em> API design is memorable and unambiguous. It encourages readable, correct and performant code, and helps developers fall into <a href=\"https://blog.codinghorror.com/falling-into-the-pit-of-success/\">the pit of success</a>.</p>\n<p>I call these design aspects “first order” because they are the first things a library developer tends to focus on. You might have to compromise on some of them and make tradeoffs but at least they’re always on your mind.</p>\n<p>However, unless you’re sending a rover to Mars, your code will probably change over time. And so will the code of your API consumers.</p>\n<p>The best API designers I know don’t stop at the “first order” aspects like readability. They dedicate just as much, if not more, effort to what I call the “second order” API design: <strong>how code using this API would evolve over time.</strong></p>\n<p>A slight change in requirements can make the most elegant code fall apart.</p>\n<p><em>Great</em> APIs anticipate that. They anticipate that you’ll want to move some code. Copy and paste some part. Rename it. Unify special cases into a generic reusable helper. Unwind an abstraction back into specific cases. Add a hack. Optimize a bottleneck. Throw away a part and start it anew. Make a mistake. Navigate between the cause and the effect. Fix a bug. Review the fix.</p>\n<p>Great APIs not only let you fall into a pit of success, but help you <em>stay</em> there.</p>\n<p>They’re optimized for change.</p>\n","frontmatter":"title: Optimized for Change\ndate: '2018-12-12'\nspoiler: What makes a great API?","link":"/post/optimized-for-change","next":{"title":"做好技术分享，第一章：驱动","date":"2018-12-26","spoiler":"这是我对美妙分享灵感的秘方","featured":true,"link":"/post/preparing-for-tech-talk-part-1-motivation-zh","min2read":"☕️ 5 min read","wordcount":"1.7k"},"prev":{"title":"应变而优","date":"2018-12-12","spoiler":"什么造就了一个优秀的API?","featured":true,"link":"/post/optimized-for-change-zh","min2read":"☕️ 1 min read","wordcount":414}}}